renesas/rx-driver-package/source/r_wifi_esp8266/r_wifi_esp8266_vx.xx/r_wifi_esp8266/src/r_wifi_esp8266_api.c
static TickType_t g_wifi_tcp_recv_timeout = 3000;		/* ## slowly problem ## unit: 1ms */

static SemaphoreHandle_t g_wifi_tx_semaphore = NULL;
static SemaphoreHandle_t g_wifi_rx_semaphore = NULL;

static const TickType_t xMaxSemaphoreBlockTime = pdMS_TO_TICKS( 60000UL );

uint32_t g_wifi_sci_err_flag;

wifi_err_t R_WIFI_ESP8266_Open(void)
{
	int32_t ret;
	uint8_t *pcbuff;
	wifi_err_t api_ret = WIFI_SUCCESS;
	uint8_t open_phase;
	uint8_t byteq_open_count;
	int32_t k;

	if( WIFI_SYSTEM_CLOSE != g_wifi_system_state)
	{
		return WIFI_ERR_ALREADY_OPEN;
	}

	/* Memory initialize */

    memset(g_wifi_uart, 0, sizeof(g_wifi_uart));
    g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff = g_wifi_at_command_buff;
    g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff_size = sizeof(g_wifi_at_command_buff);
    g_wifi_uart[WIFI_UART_COMMAND_PORT].response_buff = g_wifi_at_response_buff;
    g_wifi_uart[WIFI_UART_COMMAND_PORT].response_buff_size = sizeof(g_wifi_at_response_buff);

    pcbuff = g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff;

	g_wifi_tx_busiz_command = g_wifi_serial_buffsize_table[0][0];
	g_wifi_tx_busiz_data    = g_wifi_serial_buffsize_table[0][0];
	g_wifi_rx_busiz_command = g_wifi_serial_buffsize_table[0][1];
	g_wifi_rx_busiz_data    = g_wifi_serial_buffsize_table[0][1];

	memset(g_wifi_socket, 0, sizeof(g_wifi_socket));

	wifi_init_at_execute_queue();

	open_phase = 0;
	/* Phase 1: ByteQ initialize */
	for(byteq_open_count = 0;byteq_open_count <WIFI_CFG_CREATABLE_SOCKETS; byteq_open_count++)
	{
		if(BYTEQ_SUCCESS != R_BYTEQ_Open(g_wifi_socket[byteq_open_count].socket_recv_buff, sizeof(g_wifi_socket[byteq_open_count].socket_recv_buff), &g_wifi_socket[byteq_open_count].socket_byteq_hdl))
		{
			break;
		}
	}

	if(byteq_open_count >= WIFI_CFG_CREATABLE_SOCKETS)
	{
		/* Success */
		open_phase |= 0x01;
	}
	else
	{
		api_ret = WIFI_ERR_BYTEQ_OPEN;
	}

	if(WIFI_SUCCESS == api_ret)
	{
	    /* Phase 3 Semaphore tx initialize */
	    if (g_wifi_tx_semaphore != NULL)
	    {
	        vSemaphoreDelete(g_wifi_tx_semaphore);
	    }
	    g_wifi_tx_semaphore = xSemaphoreCreateMutex();

	    if( g_wifi_tx_semaphore != NULL )
	    {
			/* Success */
			open_phase |= 0x02;
	    }
	    else
	    {
	    	api_ret = WIFI_ERR_TAKE_MUTEX;
	    }
	}

	if(WIFI_SUCCESS == api_ret)
	{
	    /* Phase 4 Semaphore rx initialize */
	    if (g_wifi_rx_semaphore != NULL)
	    {
	        vSemaphoreDelete(g_wifi_rx_semaphore);
	    }

	    g_wifi_rx_semaphore = xSemaphoreCreateMutex();

	    if( g_wifi_rx_semaphore != NULL )
	    {
			/* Success */
			open_phase |= 0x04;
	    }
	    else
	    {
	    	api_ret = WIFI_ERR_TAKE_MUTEX;
	    }
	}

	if(WIFI_SUCCESS == api_ret)
	{
	    /* Phase 4 Serial initialize */
	    WIFI_RESET_DDR(WIFI_CFG_RESET_PORT, WIFI_CFG_RESET_PIN) = 1;
		WIFI_RESET_DR(WIFI_CFG_RESET_PORT, WIFI_CFG_RESET_PIN) = 0;
		vTaskDelay(2);
		WIFI_RESET_DR(WIFI_CFG_RESET_PORT, WIFI_CFG_RESET_PIN) = 1;
		vTaskDelay(2000);

		ret = wifi_serial_open(WIFI_UART_BAUDRATE_DEFAULT);
		if(0 == ret)
		{
			/* Success */
			open_phase |= 0x08;
		}
		else
		{
	    	api_ret = WIFI_ERR_SERIAL_OPEN;
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
	    /* Phase 5 Task initialize */
		if(0 == wifi_start_recv_task())
		{
			vTaskDelay( 2 );
			/* Success */
			open_phase |= 0x10;
		}
		else
		{
			api_ret = WIFI_ERR_SERIAL_OPEN;
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
		/* no echo */
		ret = wifi_execute_at_command(WIFI_UART_COMMAND_PORT, "ATE0\r\n", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_ECHO_OFF, 0xff);
		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
		/* Show Version information  */
		ret = wifi_execute_at_command(WIFI_UART_COMMAND_PORT, "AT+GMR\r\n", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_GET_MODULE_VERSION, 0xff);
		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
#if (WIFI_CFG_SCI_USE_FLOW_CONTROL == 1)
		sprintf((char *)pcbuff, "AT+UART_CUR=%d,8,1,0,1\r\n",WIFI_CFG_SCI_BAUDRATE);
#else
		sprintf((char *)pcbuff, "AT+UART_CUR=%d,8,1,0,0\r\n",WIFI_CFG_SCI_BAUDRATE);
#endif
		ret = wifi_execute_at_command(WIFI_UART_COMMAND_PORT, pcbuff, 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_UART_HISPEED, 0xff);
		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
		wifi_serial_close();
		wifi_serial_open(WIFI_CFG_SCI_BAUDRATE);
#if (WIFI_CFG_SCI_USE_FLOW_CONTROL == 1)
		R_SCI_Control(g_wifi_uart[WIFI_UART_COMMAND_PORT].wifi_uart_sci_handle, SCI_CMD_EN_CTS_IN, NULL);
		R_BSP_SoftwareDelay(1000, BSP_DELAY_MILLISECS); /* Wait Module baudrate change */
#endif

		ret = wifi_execute_at_command(WIFI_UART_COMMAND_PORT, "AT+CIPDNS_CUR=0\r\n", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_DNS_SRV_ADDRESS, 0xff);
		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
		/* Station mode is enabled. */
		ret = wifi_execute_at_command(WIFI_UART_COMMAND_PORT, "AT+CWMODE=1\r\n", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_WIFI_ACT_MODE, 0xff);
		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
		ret = wifi_execute_at_command(WIFI_UART_COMMAND_PORT, "AT+CIPSNTPCFG=1,-9,\"ntp1.jst.mfeed.ad.jp\"\r\n", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_DNS_SRV_ADDRESS, 0xff);
		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
		ret = wifi_execute_at_command(WIFI_UART_COMMAND_PORT, "AT+CIPMUX=1\r\n", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_MULTIPLE_SOCKET, 0xff);
		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
	}

	if(api_ret == WIFI_SUCCESS)
	{
		g_wifi_system_state = WIFI_SYSTEM_OPEN;
	}
	else
	{
		if(0 != (open_phase & 0x10))
		{
			wifi_delete_recv_task();
		}
		if(0 != (open_phase & 0x08))
		{
			wifi_serial_close();
		}
		if(0 != (open_phase & 0x04))
		{
			vSemaphoreDelete(g_wifi_rx_semaphore);
			g_wifi_rx_semaphore = NULL;
		}
		if(0 != (open_phase & 0x02))
		{
			vSemaphoreDelete(g_wifi_tx_semaphore);
			g_wifi_tx_semaphore = NULL;
		}
		if(0 != (open_phase & 0x01))
		{
			for(k = 0; k < byteq_open_count; k++)
			{
				R_BYTEQ_Close(g_wifi_socket[k].socket_byteq_hdl);
			}
		}
	}
	return api_ret;
}

wifi_err_t R_WIFI_ESP8266_Close(void)
{
	int i;
	wifi_err_t api_ret = WIFI_SUCCESS;

	if(0 == R_WIFI_ESP8266_IsConnected())
	{
		R_WIFI_ESP8266_Disconnect();
	}
	wifi_serial_close();
	wifi_delete_recv_task();
	for(i=0; i<WIFI_CFG_CREATABLE_SOCKETS; i++)
	{
		R_BYTEQ_Close(g_wifi_socket[i].socket_byteq_hdl);
	}

	g_wifi_system_state = WIFI_SYSTEM_CLOSE;

	return api_ret;
}

wifi_err_t R_WIFI_ESP8266_SetDnsServerAddress(uint32_t dnsaddress1, uint32_t dnsaddress2)
{
	int32_t ret;
	wifi_err_t api_ret = WIFI_SUCCESS;
    uint8_t mutex_flag;
	uint8_t *pcbuff = g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff;

