renesas/rx-driver-package/source/r_wifi_esp8266/r_wifi_esp8266_vx.xx/r_wifi_esp8266/src/r_wifi_esp8266_api.c
	if(NULL == pipconfig)
	{
		return WIFI_ERR_PARAMETER;
	}
	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_OPEN;
	}

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != wifi_take_mutex(mutex_flag))
	{
		api_ret = WIFI_ERR_TAKE_MUTEX;
	}

    if(WIFI_SUCCESS == api_ret)
	{
		ret = wifi_execute_at_command(WIFI_UART_COMMAND_PORT, "AT+CIPSTA_CUR?\r\n", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_GET_IPADDRESS, 0xff);
		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
		memcpy(pipconfig, &g_wifi_ipconfig, sizeof(wifi_ip_configuration_t));
	}
	if(WIFI_ERR_TAKE_MUTEX != api_ret)
	{
		wifi_give_mutex(mutex_flag);
	}
	return api_ret;
}

wifi_err_t R_WIFI_ESP8266_Scan (wifi_scan_result_t *pap_results, uint32_t maxnetworks, uint32_t *exist_ap_list)
{
    int32_t ret;
	uint8_t mutex_flag;
	wifi_err_t api_ret = WIFI_SUCCESS;

    if ((NULL == pap_results) || (0 == maxnetworks) || (NULL == exist_ap_list))
    {
    	return WIFI_ERR_PARAMETER;
    }
	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_OPEN;
	}

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != wifi_take_mutex(mutex_flag))
	{
		api_ret = WIFI_ERR_TAKE_MUTEX;
	}
	if(WIFI_SUCCESS == api_ret)
	{
	    gp_wifi_ap_results = pap_results;
	    g_wifi_aplistmax = maxnetworks;
		g_wifi_aplist_stored_num = 0;
		g_wifi_aplist_count = 0;
		ret = wifi_execute_at_command(WIFI_UART_COMMAND_PORT, "AT+CWLAP\r\n", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_GET_APLIST, 0xff);
		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
		else
		{
			*exist_ap_list = g_wifi_aplist_count;
		}
	}
	if(WIFI_ERR_TAKE_MUTEX != api_ret)
	{
		wifi_give_mutex(mutex_flag);
	}

	return api_ret;
}

int32_t R_WIFI_ESP8266_SocketCreate(uint32_t type, uint32_t ipversion)
{
	int32_t i;
	int32_t ret;
	uint8_t mutex_flag;
	wifi_err_t api_ret = WIFI_SUCCESS;

	if(type != WIFI_SOCKET_IP_PROTOCOL_TCP || ipversion != WIFI_SOCKET_IP_VERSION_4)
	{
		return WIFI_ERR_PARAMETER;
	}
	if( 0 != R_WIFI_ESP8266_IsConnected())
	{
		return WIFI_ERR_NOT_CONNECT;
	}

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != wifi_take_mutex(mutex_flag))
	{
    	api_ret = WIFI_ERR_TAKE_MUTEX;
	}
	if(WIFI_SUCCESS == api_ret)
	{

		for(i=0;i<WIFI_CFG_CREATABLE_SOCKETS;i++)
		{
			if(g_wifi_socket[i].socket_create_flag == 0)
			{
				g_wifi_socket[i].socket_create_flag = 1;
				g_wifi_socket[i].ipversion = ipversion;
				g_wifi_socket[i].protocol = type;
				g_wifi_socket[i].socket_status = WIFI_SOCKET_STATUS_SOCKET;
				g_wifi_socket[i].ssl_flag = 0;
				g_wifi_socket[i].ssl_type = 0;
				R_BYTEQ_Flush(g_wifi_socket[i].socket_byteq_hdl);
				break;
			}
		}

        /* Give back the socketInUse mutex. */
        wifi_give_mutex(mutex_flag);
        if(i < WIFI_CFG_CREATABLE_SOCKETS)
        {
        	ret = i;
        }
        else
        {
        	ret = WIFI_ERR_SOCKET_CREATE;
        }
    }
    else
    {
    	ret = api_ret;
    }

	return ret;
}



wifi_err_t R_WIFI_ESP8266_SocketConnect (int32_t socket_no, uint32_t ipaddr, uint16_t port)
{
	int32_t ret;
	uint8_t mutex_flag;
	wifi_err_t api_ret = WIFI_SUCCESS;

	if( (0 == ipaddr) || (0 == port) )
	{
		return  WIFI_ERR_PARAMETER;
	}
	if( (socket_no >= WIFI_CFG_CREATABLE_SOCKETS) || (socket_no < 0) || (g_wifi_socket[socket_no].socket_status != WIFI_SOCKET_STATUS_SOCKET) )
	{
		return  WIFI_ERR_SOCKET_NUM;
	}
	if( 0 != R_WIFI_ESP8266_IsConnected())
	{
		return WIFI_ERR_NOT_CONNECT;
	}

	mutex_flag = (MUTEX_TX | MUTEX_RX);
	if(0 != wifi_take_mutex(mutex_flag))
	{
		api_ret = WIFI_ERR_TAKE_MUTEX;
	}
	if(WIFI_SUCCESS == api_ret)
	{

			sprintf((char *)g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff,"AT+CIPSTART=%d,\"TCP\",\"%d.%d.%d.%d\",%d\r\n",
					socket_no,
					WIFI_ULONG_TO_IPV4BYTE_1(ipaddr), WIFI_ULONG_TO_IPV4BYTE_2(ipaddr),
					WIFI_ULONG_TO_IPV4BYTE_3(ipaddr), WIFI_ULONG_TO_IPV4BYTE_4(ipaddr),
					port);

			ret = wifi_execute_at_command(WIFI_UART_COMMAND_PORT, g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff, 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_SOCKET_CONNECT, socket_no);
			if(ret != 0)
			{
				api_ret = WIFI_ERR_MODULE_COM;
			}
	}
	if(WIFI_SUCCESS == api_ret)
	{
		g_wifi_socket[socket_no].socket_status = WIFI_SOCKET_STATUS_CONNECTED;
	}
	if(WIFI_ERR_TAKE_MUTEX != api_ret)
	{
		wifi_give_mutex(mutex_flag);
	}
	return api_ret;
}


int32_t R_WIFI_ESP8266_SocketSend (int32_t socket_no, uint8_t *pdata, int32_t length, uint32_t timeout_ms)
{
	volatile int32_t timeout;
	volatile int32_t sended_length;
	int32_t current_send_length;
	int32_t api_ret;
	int32_t ret;
	sci_err_t ercd;
	int8_t get_queue;
	wifi_return_code_t result;
	uint8_t mutex_flag;
	uint32_t ticket_no;

	if( (pdata == NULL) || (length < 0 ))
	{
		return  WIFI_ERR_PARAMETER;
	}

	if( 0 != R_WIFI_ESP8266_IsConnected())
	{
		return WIFI_ERR_NOT_CONNECT;
	}

	if( (socket_no >= WIFI_CFG_CREATABLE_SOCKETS) || (socket_no < 0) || (0 == g_wifi_socket[socket_no].socket_create_flag) || (g_wifi_socket[socket_no].socket_status != WIFI_SOCKET_STATUS_CONNECTED) )
	{
		return  WIFI_ERR_SOCKET_NUM;
	}

	mutex_flag = MUTEX_TX;
    if(0 == wifi_take_mutex(mutex_flag))
	{
		sended_length = 0;

		if(0 != timeout_ms)
		{
			socket_timeout_init(socket_no, timeout_ms, 0);
		}
		while(sended_length < length)
		{

			if(length - sended_length > g_wifi_tx_busiz_data)
			{
				current_send_length = g_wifi_tx_busiz_data;
			}
			else
			{
				current_send_length = length - sended_length;
			}

			if(current_send_length > WIFI_SOCKET_SENDABLE_DATASIZE)
			{
				current_send_length = WIFI_SOCKET_SENDABLE_DATASIZE;
			}

			sprintf((char *)g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff, "AT+CIPSEND=%d,%d\r\n" ,socket_no, current_send_length);

			ret = wifi_execute_at_command(WIFI_UART_COMMAND_PORT, g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff, 10000, WIFI_RETURN_ENUM_OK_GO_SEND, WIFI_COMMAND_SET_SOCKET_SEND_START, socket_no);

			if(ret != 0)
			{
				break;
			}

			timeout = 0;

			timeout_init(WIFI_UART_COMMAND_PORT, 5000);
			ticket_no = wifi_set_request_in_queue( WIFI_COMMAND_SET_SOCKET_SEND_DATA, socket_no );
			g_wifi_uart[WIFI_UART_COMMAND_PORT].tx_end_flag = 0;
			ercd = R_SCI_Send(g_wifi_uart[WIFI_UART_COMMAND_PORT].wifi_uart_sci_handle, pdata+sended_length, current_send_length);
			if(SCI_SUCCESS != ercd)
			{
				break;
			}

			while(1)
			{
				if(0 != g_wifi_uart[WIFI_UART_COMMAND_PORT].tx_end_flag)
				{
					break;
				}
				vTaskDelay(1);
			}

			while(1)
			{
				get_queue = wifi_get_result_from_queue( ticket_no, &result);
				if(0 == get_queue)
				{
					break;
				}
				if(0 != timeout_ms)
				{
					if(-1 == check_timeout(WIFI_UART_COMMAND_PORT, 0))
					{
						wifi_set_result_to_current_running_queue( WIFI_RETURN_ENUM_INTERNAL_TIMEOUT );
						timeout = 1;
						break;
					}
				}
				vTaskDelay(1);
			}

