renesas/rx-driver-package/source/r_wifi_esp8266/r_wifi_esp8266_vx.xx/r_wifi_esp8266/src/r_wifi_esp8266_api.c
			if(1 == timeout)
			{
				break;
			}
			if(result != WIFI_RETURN_ENUM_SEND_OK)
			{
				break;
			}

			sended_length += current_send_length;
			if(-1 == socket_check_timeout(socket_no, 0))
			{
				break;
			}
		}
		api_ret = sended_length;

		/* Give back the socketInUse mutex. */
		wifi_give_mutex(mutex_flag);
    }
    else
    {
    	api_ret = WIFI_ERR_TAKE_MUTEX;
    }
	return api_ret;
}

int32_t R_WIFI_ESP8266_SocketRecv (int32_t socket_no, uint8_t *pdata, int32_t length, uint32_t timeout_ms)
{
	uint32_t recvcnt;
	uint32_t recv_length;
	uint32_t i;
	int32_t api_ret;
	volatile int32_t timeout;
	int32_t ret;
	byteq_err_t byteq_ret;
	uint8_t mutex_flag;

	if( (pdata == NULL) || (length <= 0 ))
	{
		return  WIFI_ERR_PARAMETER;
	}

	if( 0 != R_WIFI_ESP8266_IsConnected())
	{
		return WIFI_ERR_NOT_CONNECT;
	}

	if( (socket_no >= WIFI_CFG_CREATABLE_SOCKETS) || (socket_no < 0) || (0 == g_wifi_socket[socket_no].socket_create_flag) ||  (g_wifi_socket[socket_no].socket_status != WIFI_SOCKET_STATUS_CONNECTED) )
	{
		return  WIFI_ERR_SOCKET_NUM;
	}

	mutex_flag = MUTEX_RX;
    if(0 == wifi_take_mutex(mutex_flag))
    {
		recvcnt = 0;

		if((timeout_ms != 0) && (timeout_ms != portMAX_DELAY))
		{
			socket_timeout_init(socket_no, timeout_ms, 1);
		}

		while(1)
		{
			byteq_ret = R_BYTEQ_Get(g_wifi_socket[socket_no].socket_byteq_hdl, (pdata + recvcnt));
			if(BYTEQ_SUCCESS == byteq_ret)
			{
				recvcnt++;
				if(recvcnt >= length)
				{
					break;
				}
				continue;
			}
			if(g_wifi_socket[socket_no].socket_status != WIFI_SOCKET_STATUS_CONNECTED)
			{
				break;
			}
			if(g_wifi_system_state != WIFI_SYSTEM_CONNECT)
			{
				break;
			}
			if((timeout_ms != 0) && (timeout_ms != portMAX_DELAY))
			{
				if(-1 == socket_check_timeout(socket_no, 1))
				{
					R_BSP_NOP();
					break;
				}
			}
			vTaskDelay(1);
		}
		api_ret = recvcnt;
		/* Give back the socketInUse mutex. */
    	wifi_give_mutex(mutex_flag);
    }
    else
    {
    	api_ret = WIFI_ERR_TAKE_MUTEX;
    }
	return api_ret;
}


wifi_err_t R_WIFI_ESP8266_SocketShutdown (int32_t socket_no)
{
	wifi_err_t api_ret = WIFI_SUCCESS;
	int32_t subroutain_ret;
	uint8_t mutex_flag;

	if((socket_no >= WIFI_CFG_CREATABLE_SOCKETS) || (socket_no < 0) ||
			(0 == g_wifi_socket[socket_no].socket_create_flag) || (g_wifi_socket[socket_no].socket_status <= WIFI_SOCKET_STATUS_SOCKET))
	{
		return WIFI_ERR_SOCKET_NUM;
	}
	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_OPEN;
	}
	mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 == wifi_take_mutex(mutex_flag))
	{
		sprintf((char *)g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff,"AT+CIPCLOSE=%d\r\n",socket_no);
		subroutain_ret = wifi_execute_at_command(WIFI_UART_COMMAND_PORT, g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff, 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_SOCKET_CLOSE, socket_no);
		if(subroutain_ret != 0)
		{
	    	api_ret = WIFI_ERR_MODULE_COM;
		}
		else
		{
			g_wifi_socket[socket_no].socket_status = WIFI_SOCKET_STATUS_SOCKET;
		}
		/* Give back the mutex. */
		wifi_give_mutex(mutex_flag);
    }
    else
    {
    	api_ret = WIFI_ERR_TAKE_MUTEX;
    }
	return api_ret;

}

wifi_err_t R_WIFI_ESP8266_SocketClose (int32_t socket_no)
{
	wifi_err_t api_ret = WIFI_SUCCESS;

	if((socket_no >= WIFI_CFG_CREATABLE_SOCKETS) || (socket_no < 0))
	{
		return WIFI_ERR_SOCKET_NUM;
	}
	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_OPEN;
	}

	if(g_wifi_socket[socket_no].socket_create_flag == 1)
	{
		R_WIFI_ESP8266_SocketShutdown (socket_no);
		R_BYTEQ_Flush(g_wifi_socket[socket_no].socket_byteq_hdl);
		g_wifi_socket[socket_no].ipversion = 0;
		g_wifi_socket[socket_no].protocol = 0;
		g_wifi_socket[socket_no].socket_create_flag = 0;
		g_wifi_socket[socket_no].ssl_flag = 0;
		g_wifi_socket[socket_no].ssl_type = 0;
		g_wifi_socket[socket_no].socket_status = WIFI_SOCKET_STATUS_CLOSED;
	}
	return api_ret;

}


wifi_err_t R_WIFI_ESP8266_DnsQuery (uint8_t *pdomain_name, uint32_t *pipaddress)
{
	int32_t func_ret;
	uint8_t mutex_flag;
	wifi_err_t api_ret = WIFI_SUCCESS;

    if ((NULL == pdomain_name) || (NULL == pipaddress))
    {
    	return WIFI_ERR_PARAMETER;
    }
	if( 0 != R_WIFI_ESP8266_IsConnected())
	{
		return WIFI_ERR_NOT_CONNECT;
	}

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != wifi_take_mutex(mutex_flag))
	{
		api_ret = WIFI_ERR_TAKE_MUTEX;
	}
	if(WIFI_SUCCESS == api_ret)
	{
		strcpy((char *)g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff,"AT+CIPDOMAIN=\"");
		sprintf((char *)g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff+strlen((char *)g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff),"%s\"\r\n",pdomain_name);

		func_ret = wifi_execute_at_command(WIFI_UART_COMMAND_PORT, g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff, 20000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_DNSQUERY, 0xff);
		if(func_ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
		else
		{
			*pipaddress = g_wifi_dnsaddress;
		}
	}
	if(WIFI_ERR_TAKE_MUTEX != api_ret)
	{
		wifi_give_mutex(mutex_flag);
	}

	return api_ret;
}


wifi_err_t R_WIFI_ESP8266_Ping (uint32_t ipaddr, uint16_t count, uint32_t intervalms)
{
	int32_t func_ret;
	uint8_t mutex_flag;
	uint32_t i;
	wifi_err_t api_ret = WIFI_SUCCESS;

	if ((0 == ipaddr) || (0 == count))
	{
		return WIFI_ERR_PARAMETER;
	}
	if( 0 != R_WIFI_ESP8266_IsConnected())
	{
		return WIFI_ERR_NOT_CONNECT;
	}

	for(i=0;i<count;i++)
	{
	    mutex_flag = (MUTEX_TX | MUTEX_RX);
	    if(0 != wifi_take_mutex(mutex_flag))
		{
			api_ret = WIFI_ERR_TAKE_MUTEX;
		}
		if(WIFI_SUCCESS == api_ret)
		{
			strcpy((char *)g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff,"AT+PING=\"");
			sprintf((char *)g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff+strlen((char *)g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff),"%d.%d.%d.%d\"\r\n",
					(uint8_t)(ipaddr >> 24),(uint8_t)((ipaddr >> 16) & 0xFF), (uint8_t)((ipaddr >> 8) & 0xFF), (uint8_t)((ipaddr) & 0xFF));
			func_ret = wifi_execute_at_command(WIFI_UART_COMMAND_PORT, g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff, 20000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_PING, 0xff);
			if(func_ret != 0)
			{
				api_ret = WIFI_ERR_MODULE_COM;
			}
			else
			{
			}
		}
		if(WIFI_ERR_TAKE_MUTEX != api_ret)
		{
			wifi_give_mutex(mutex_flag);
		}
		if(WIFI_SUCCESS == api_ret)
		{
			vTaskDelay(intervalms);
		}
		else
		{
			break;
		}
	}
	return api_ret;
}

uint32_t R_WIFI_ESP8266_GetVersion(void)
{
    /* These version macros are defined in r_wifi_esp8266_if.h. */
    return ((((uint32_t)WIFI_ESP8266_VERSION_MAJOR) << 16) | (uint32_t)WIFI_ESP8266_VERSION_MINOR);
}

static int32_t wifi_execute_at_command(uint8_t serial_ch_id, uint8_t *ptextstring, uint16_t timeout_ms, wifi_return_code_t expect_code,  wifi_command_list_t command, int32_t socket_no)
{
	volatile int32_t timeout;
	sci_err_t ercd;
	int8_t  get_queue;
	uint32_t recvcnt = 0;
	int32_t ret;
	wifi_return_code_t result;
	uint32_t ticket_no;

